{
    "nav": {
        "home": "Início",
        "link": "/pt",
        "top": "Voltar ao topo"
    },
    "page": {
        "title": "Katsuragawa • Engenheiro de Software",
        "description": "Página inicial do site do meu portfólio. Aqui você pode encontrar detalhes sobre minhas experiências profissionais e projetos pessoais nos quais tenho trabalhado nos últimos anos."
    },
    "me": {
        "title": "Engenheiro de Software com foco no produto",
        "sub": "Eu construo coisas."
    },
    "about": {
        "title": "Sobre",
        "text": "Eu gosto de construir produtos dinâmicos e criativos do início ao fim. Focado no Desenvolvimento de experiências intuitivas que crescem e melhoram constantemente com base na métrica do usuário. Sempre entregando."
    },
    "work": {
        "title": "Experiências Profissionais",
        "meli": {
            "title": "Engenheiro de Software • Mercado Livre",
            "link": "/pt/experiences/meli",
            "years": "2022 - atual",
            "description": "Criação de novos produtos de back office para centros de distribuição em toda a América Latina, utilizados pelos analistas para otimizar a logística e reduzir custos",
            "tech": "React • Java • Golang • Python"
        },
        "prevision": {
            "title": "Desenvolvedor Full Stack • Prevision",
            "link": "/pt/experiences/prevision",
            "years": "2020 - 2022",
            "description": "Desenvolvimento de uma aplicação baseada na web para planejamento visual utilizando a metodologia Lean Construction, que foi utilizada por milhares de empresas de construção em todo o país.",
            "tech": "Vue • Ruby on Rails • GraphQL"
        },
        "freelancer": {
            "title": "Desenvolvedor Front End • Freelancer",
            "years": "2019 - 2020",
            "description": "Desenvolvimento de componentes UI usando a biblioteca React, consumindo APIs através de REST e/ou GraphQL.",
            "tech": "React • Redux • Styled Components • Framer Motion"
        },
        "tecza": {
            "title": "Trainee • Tecza",
            "years": "2018 - 2019",
            "description": "Apoio na supervisão do desenvolvimento da plataforma de gestão da construção civil.",
            "tech": "Javascript • Python • Flask"
        }
    },
    "projects": {
        "title": "Side Projects",
        "nextree": {
            "title": "Nextree",
            "years": "2022",
            "description": "Um aplicativo similar ao tree que ajuda a visualizar e criar sua estrutura de pastas perfeita",
            "tech": "Next.js • Typescript"
        },
        "krypt": {
            "title": "Krypt",
            "years": "2021",
            "description": "Uma aplicação de blockchain na web 3.0 para enviar criptomoedas com um GIF.",
            "tech": "React • Vite • Solidity"
        },
        "payflow": {
            "title": "Payflow",
            "years": "2021",
            "description": "Aplicação mobile para gerenciamento de boletos",
            "tech": "Flutter • Firebase"
        },
        "letmeask": {
            "title": "Letmeask",
            "years": "2020",
            "description": "Aplicação web para facilitar as sessões de perguntas e respostas durante os livestreams",
            "tech": "React • Typescript • Firebase"
        }
    },
    "links": {
        "title": "Links",
        "github": {
            "site": "GitHub",
            "user": "@katsuragawaa"
        },
        "linkedin": {
            "site": "LinkedIn",
            "user": "@andrekatsuragawa"
        }
    },
    "meli": {
        "title": "Mercado Livre",
        "link": "https://www.mercadolivre.com.br/",
        "description": {
            "a": "Criação de novos produtos de back office para centros de distribuição em toda a América Latina.",
            "b": "Sempre em um ambiente ágil",
            "c": "Usando o desenvolvimento Test Driven para construir funcionalidades de acordo com os requisitos e código Orientado a Objetos",
            "d": "Uso diário de Git e lançamento automatizado com CI/CD",
            "e": "Ambiente de desenvolvimento local conteinerizado com Docker",
            "f": "Revisão do código como um processo padrão antes do deploy, visando desenvolver código limpo e respeitando os princípios da SOLID"
        },
        "bullet": {
            "title": "Coisas que eu faço:",
            "item": {
                "a": "Concepção de arquiteturas de microserviços",
                "b": "Desenvolvimento dos serviços que compõem o ecossistema do Mercado Envios em Java e Golang",
                "c": "Responsável da equipe no desenvolvimento do front-end usando a renderização Server-Side com React and Node",
                "d": "Participação em reuniões de produtos, contribuindo com a visão do projeto",
                "e": "Criação e monitoramento de métricas dos sistemas utilizados para melhoria contínua",
                "f": "Preparar apresentações e workshops sobre temas específicos para o desenvolvimento da equipe",
                "g": "Mentoria para desenvolvedores júniors"
            }
        }
    },
    "prevision": {
        "title": "Prevision",
        "link": "https://www.prevision.com.br/",
        "description": {
            "a": "Desenvolvimento de uma aplicação web para planejamento visual utilizando a metodologia Lean Construction.",
            "b": "Utilizou Vue.js e Ruby on Rails para desenvolver a Prevision.",
            "c": "Colaborou com o Chefe de Produto para acompanhar os objetivos táticos, melhorar as direções técnicas e aumentar a frequência de lançamentos."
        },
        "bullet": {
            "title": "Coisas que eu fiz:",
            "item": {
                "a": "Projetei e desenvolvi uma nova camada de informação para o planejamento de construção detalhado, incluindo novas tabelas de dados e pontos finais de API, bem como um design de front-end melhorado",
                "b": "Otimizei uma funcionalidade que tinha alta latência, reduzindo o tempo de carregamento em quase 80% através de consultas SQL eficientes e cálculos melhorados"
            }
        }
    }
}
